UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32u5x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32U5x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32U5x_PINMUX_H_)
# define _STM32U5x_PINMUX_H_

#define ADF1_CCK0_FUNC           0
#define ADF1_CCK1_FUNC           1
#define ADF1_SDI0_FUNC           2
#define AUDIOCLK_FUNC            3
#define COMP1_OUT_FUNC           4
#define COMP2_OUT_FUNC           5
#define CRS_SYNC_FUNC            6
#define DCMI_D0_FUNC             7
#define DCMI_D1_FUNC             8
#define DCMI_D10_FUNC            9
#define DCMI_D11_FUNC            10
#define DCMI_D12_FUNC            11
#define DCMI_D13_FUNC            12
#define DCMI_D2_FUNC             13
#define DCMI_D3_FUNC             14
#define DCMI_D4_FUNC             15
#define DCMI_D5_FUNC             16
#define DCMI_D6_FUNC             17
#define DCMI_D7_FUNC             18
#define DCMI_D8_FUNC             19
#define DCMI_D9_FUNC             20
#define DCMI_HSYNC_FUNC          21
#define DCMI_PIXCLK_FUNC         22
#define DCMI_VSYNC_FUNC          23
#define DEBUG_JTCK_SWCLK_FUNC    24
#define DEBUG_JTDI_FUNC          25
#define DEBUG_JTDO_SWO_FUNC      26
#define DEBUG_JTMS_SWDIO_FUNC    27
#define DEBUG_JTRST_FUNC         28
#define DEBUG_TRACECLK_FUNC      29
#define DEBUG_TRACED0_FUNC       30
#define DEBUG_TRACED1_FUNC       31
#define DEBUG_TRACED2_FUNC       32
#define DEBUG_TRACED3_FUNC       33
#define EVENTOUT_FUNC            34
#define FDCAN1_RX_FUNC           35
#define FDCAN1_TX_FUNC           36
#define FMC_A0_FUNC              37
#define FMC_A1_FUNC              38
#define FMC_A10_FUNC             39
#define FMC_A11_FUNC             40
#define FMC_A12_FUNC             41
#define FMC_A13_FUNC             42
#define FMC_A14_FUNC             43
#define FMC_A15_FUNC             44
#define FMC_A16_FUNC             45
#define FMC_A17_FUNC             46
#define FMC_A18_FUNC             47
#define FMC_A19_FUNC             48
#define FMC_A2_FUNC              49
#define FMC_A20_FUNC             50
#define FMC_A21_FUNC             51
#define FMC_A22_FUNC             52
#define FMC_A23_FUNC             53
#define FMC_A24_FUNC             54
#define FMC_A25_FUNC             55
#define FMC_A3_FUNC              56
#define FMC_A4_FUNC              57
#define FMC_A5_FUNC              58
#define FMC_A6_FUNC              59
#define FMC_A7_FUNC              60
#define FMC_A8_FUNC              61
#define FMC_A9_FUNC              62
#define FMC_CLK_FUNC             63
#define FMC_D0_FUNC              64
#define FMC_D1_FUNC              65
#define FMC_D10_FUNC             66
#define FMC_D11_FUNC             67
#define FMC_D12_FUNC             68
#define FMC_D13_FUNC             69
#define FMC_D14_FUNC             70
#define FMC_D15_FUNC             71
#define FMC_D2_FUNC              72
#define FMC_D3_FUNC              73
#define FMC_D4_FUNC              74
#define FMC_D5_FUNC              75
#define FMC_D6_FUNC              76
#define FMC_D7_FUNC              77
#define FMC_D8_FUNC              78
#define FMC_D9_FUNC              79
#define FMC_DA0_FUNC             80
#define FMC_DA1_FUNC             81
#define FMC_DA10_FUNC            82
#define FMC_DA11_FUNC            83
#define FMC_DA12_FUNC            84
#define FMC_DA13_FUNC            85
#define FMC_DA14_FUNC            86
#define FMC_DA15_FUNC            87
#define FMC_DA2_FUNC             88
#define FMC_DA3_FUNC             89
#define FMC_DA4_FUNC             90
#define FMC_DA5_FUNC             91
#define FMC_DA6_FUNC             92
#define FMC_DA7_FUNC             93
#define FMC_DA8_FUNC             94
#define FMC_DA9_FUNC             95
#define FMC_INT_FUNC             96
#define FMC_NBL0_FUNC            97
#define FMC_NBL1_FUNC            98
#define FMC_NCE_FUNC             99
#define FMC_NE1_FUNC             100
#define FMC_NE2_FUNC             101
#define FMC_NE3_FUNC             102
#define FMC_NE4_FUNC             103
#define FMC_NL_FUNC              104
#define FMC_NOE_FUNC             105
#define FMC_NWAIT_FUNC           106
#define FMC_NWE_FUNC             107
#define I2C1_SCL_FUNC            108
#define I2C1_SDA_FUNC            109
#define I2C1_SMBA_FUNC           110
#define I2C2_SCL_FUNC            111
#define I2C2_SDA_FUNC            112
#define I2C2_SMBA_FUNC           113
#define I2C3_SCL_FUNC            114
#define I2C3_SDA_FUNC            115
#define I2C3_SMBA_FUNC           116
#define I2C4_SCL_FUNC            117
#define I2C4_SDA_FUNC            118
#define I2C4_SMBA_FUNC           119
#define IR_OUT_FUNC              120
#define LPTIM1_CH1_FUNC          121
#define LPTIM1_CH2_FUNC          122
#define LPTIM1_ETR_FUNC          123
#define LPTIM1_IN1_FUNC          124
#define LPTIM1_IN2_FUNC          125
#define LPTIM2_CH1_FUNC          126
#define LPTIM2_CH2_FUNC          127
#define LPTIM2_ETR_FUNC          128
#define LPTIM2_IN1_FUNC          129
#define LPTIM2_IN2_FUNC          130
#define LPTIM3_CH1_FUNC          131
#define LPTIM3_CH2_FUNC          132
#define LPTIM3_ETR_FUNC          133
#define LPTIM3_IN1_FUNC          134
#define LPTIM4_ETR_FUNC          135
#define LPTIM4_IN1_FUNC          136
#define LPTIM4_OUT_FUNC          137
#define LPUART1_CTS_FUNC         138
#define LPUART1_DE_FUNC          139
#define LPUART1_RTS_FUNC         140
#define LPUART1_RX_FUNC          141
#define LPUART1_TX_FUNC          142
#define MDF1_CCK0_FUNC           143
#define MDF1_CCK1_FUNC           144
#define MDF1_CKI0_FUNC           145
#define MDF1_CKI1_FUNC           146
#define MDF1_CKI2_FUNC           147
#define MDF1_CKI3_FUNC           148
#define MDF1_CKI4_FUNC           149
#define MDF1_CKI5_FUNC           150
#define MDF1_SDI0_FUNC           151
#define MDF1_SDI1_FUNC           152
#define MDF1_SDI2_FUNC           153
#define MDF1_SDI3_FUNC           154
#define MDF1_SDI4_FUNC           155
#define MDF1_SDI5_FUNC           156
#define OCTOSPIM_P1_CLK_FUNC     157
#define OCTOSPIM_P1_DQS_FUNC     158
#define OCTOSPIM_P1_IO0_FUNC     159
#define OCTOSPIM_P1_IO1_FUNC     160
#define OCTOSPIM_P1_IO2_FUNC     161
#define OCTOSPIM_P1_IO3_FUNC     162
#define OCTOSPIM_P1_IO4_FUNC     163
#define OCTOSPIM_P1_IO5_FUNC     164
#define OCTOSPIM_P1_IO6_FUNC     165
#define OCTOSPIM_P1_IO7_FUNC     166
#define OCTOSPIM_P1_NCLK_FUNC    167
#define OCTOSPIM_P1_NCS_FUNC     168
#define OCTOSPIM_P2_CLK_FUNC     169
#define OCTOSPIM_P2_DQS_FUNC     170
#define OCTOSPIM_P2_IO0_FUNC     171
#define OCTOSPIM_P2_IO1_FUNC     172
#define OCTOSPIM_P2_IO2_FUNC     173
#define OCTOSPIM_P2_IO3_FUNC     174
#define OCTOSPIM_P2_IO4_FUNC     175
#define OCTOSPIM_P2_IO5_FUNC     176
#define OCTOSPIM_P2_IO6_FUNC     177
#define OCTOSPIM_P2_IO7_FUNC     178
#define OCTOSPIM_P2_NCLK_FUNC    179
#define OCTOSPIM_P2_NCS_FUNC     180
#define PSSI_D0_FUNC             181
#define PSSI_D1_FUNC             182
#define PSSI_D10_FUNC            183
#define PSSI_D11_FUNC            184
#define PSSI_D12_FUNC            185
#define PSSI_D13_FUNC            186
#define PSSI_D14_FUNC            187
#define PSSI_D15_FUNC            188
#define PSSI_D2_FUNC             189
#define PSSI_D3_FUNC             190
#define PSSI_D4_FUNC             191
#define PSSI_D5_FUNC             192
#define PSSI_D6_FUNC             193
#define PSSI_D7_FUNC             194
#define PSSI_D8_FUNC             195
#define PSSI_D9_FUNC             196
#define PSSI_DE_FUNC             197
#define PSSI_PDCK_FUNC           198
#define PSSI_RDY_FUNC            199
#define PWR_CDSTOP_FUNC          200
#define PWR_CSLEEP_FUNC          201
#define PWR_SRDSTOP_FUNC         202
#define RCC_MCO_FUNC             203
#define RTC_REFIN_FUNC           204
#define SAI1_CK1_FUNC            205
#define SAI1_CK2_FUNC            206
#define SAI1_D1_FUNC             207
#define SAI1_D2_FUNC             208
#define SAI1_D3_FUNC             209
#define SAI1_FS_A_FUNC           210
#define SAI1_FS_B_FUNC           211
#define SAI1_MCLK_A_FUNC         212
#define SAI1_MCLK_B_FUNC         213
#define SAI1_SCK_A_FUNC          214
#define SAI1_SCK_B_FUNC          215
#define SAI1_SD_A_FUNC           216
#define SAI1_SD_B_FUNC           217
#define SAI2_FS_A_FUNC           218
#define SAI2_FS_B_FUNC           219
#define SAI2_MCLK_A_FUNC         220
#define SAI2_MCLK_B_FUNC         221
#define SAI2_SCK_A_FUNC          222
#define SAI2_SCK_B_FUNC          223
#define SAI2_SD_A_FUNC           224
#define SAI2_SD_B_FUNC           225
#define SDMMC1_CDIR_FUNC         226
#define SDMMC1_CK_FUNC           227
#define SDMMC1_CKIN_FUNC         228
#define SDMMC1_CMD_FUNC          229
#define SDMMC1_D0_FUNC           230
#define SDMMC1_D0DIR_FUNC        231
#define SDMMC1_D1_FUNC           232
#define SDMMC1_D123DIR_FUNC      233
#define SDMMC1_D2_FUNC           234
#define SDMMC1_D3_FUNC           235
#define SDMMC1_D4_FUNC           236
#define SDMMC1_D5_FUNC           237
#define SDMMC1_D6_FUNC           238
#define SDMMC1_D7_FUNC           239
#define SDMMC2_CK_FUNC           240
#define SDMMC2_CMD_FUNC          241
#define SDMMC2_D0_FUNC           242
#define SDMMC2_D1_FUNC           243
#define SDMMC2_D2_FUNC           244
#define SDMMC2_D3_FUNC           245
#define SDMMC2_D4_FUNC           246
#define SDMMC2_D5_FUNC           247
#define SDMMC2_D6_FUNC           248
#define SDMMC2_D7_FUNC           249
#define SPI1_MISO_FUNC           250
#define SPI1_MOSI_FUNC           251
#define SPI1_NSS_FUNC            252
#define SPI1_RDY_FUNC            253
#define SPI1_SCK_FUNC            254
#define SPI2_MISO_FUNC           255
#define SPI2_MOSI_FUNC           256
#define SPI2_NSS_FUNC            257
#define SPI2_RDY_FUNC            258
#define SPI2_SCK_FUNC            259
#define SPI3_MISO_FUNC           260
#define SPI3_MOSI_FUNC           261
#define SPI3_NSS_FUNC            262
#define SPI3_RDY_FUNC            263
#define SPI3_SCK_FUNC            264
#define TIM15_BKIN_FUNC          265
#define TIM15_CH1_FUNC           266
#define TIM15_CH1N_FUNC          267
#define TIM15_CH2_FUNC           268
#define TIM16_BKIN_FUNC          269
#define TIM16_CH1_FUNC           270
#define TIM16_CH1N_FUNC          271
#define TIM17_BKIN_FUNC          272
#define TIM17_CH1_FUNC           273
#define TIM17_CH1N_FUNC          274
#define TIM1_BKIN_FUNC           275
#define TIM1_BKIN2_FUNC          276
#define TIM1_CH1_FUNC            277
#define TIM1_CH1N_FUNC           278
#define TIM1_CH2_FUNC            279
#define TIM1_CH2N_FUNC           280
#define TIM1_CH3_FUNC            281
#define TIM1_CH3N_FUNC           282
#define TIM1_CH4_FUNC            283
#define TIM1_CH4N_FUNC           284
#define TIM1_ETR_FUNC            285
#define TIM2_CH1_FUNC            286
#define TIM2_CH2_FUNC            287
#define TIM2_CH3_FUNC            288
#define TIM2_CH4_FUNC            289
#define TIM2_ETR_FUNC            290
#define TIM3_CH1_FUNC            291
#define TIM3_CH2_FUNC            292
#define TIM3_CH3_FUNC            293
#define TIM3_CH4_FUNC            294
#define TIM3_ETR_FUNC            295
#define TIM4_CH1_FUNC            296
#define TIM4_CH2_FUNC            297
#define TIM4_CH3_FUNC            298
#define TIM4_CH4_FUNC            299
#define TIM4_ETR_FUNC            300
#define TIM5_CH1_FUNC            301
#define TIM5_CH2_FUNC            302
#define TIM5_CH3_FUNC            303
#define TIM5_CH4_FUNC            304
#define TIM5_ETR_FUNC            305
#define TIM8_BKIN_FUNC           306
#define TIM8_BKIN2_FUNC          307
#define TIM8_CH1_FUNC            308
#define TIM8_CH1N_FUNC           309
#define TIM8_CH2_FUNC            310
#define TIM8_CH2N_FUNC           311
#define TIM8_CH3_FUNC            312
#define TIM8_CH3N_FUNC           313
#define TIM8_CH4_FUNC            314
#define TIM8_CH4N_FUNC           315
#define TIM8_ETR_FUNC            316
#define TSC_G1_IO1_FUNC          317
#define TSC_G1_IO2_FUNC          318
#define TSC_G1_IO3_FUNC          319
#define TSC_G1_IO4_FUNC          320
#define TSC_G2_IO1_FUNC          321
#define TSC_G2_IO2_FUNC          322
#define TSC_G2_IO3_FUNC          323
#define TSC_G2_IO4_FUNC          324
#define TSC_G3_IO1_FUNC          325
#define TSC_G3_IO2_FUNC          326
#define TSC_G3_IO3_FUNC          327
#define TSC_G3_IO4_FUNC          328
#define TSC_G4_IO1_FUNC          329
#define TSC_G4_IO2_FUNC          330
#define TSC_G4_IO3_FUNC          331
#define TSC_G4_IO4_FUNC          332
#define TSC_G5_IO1_FUNC          333
#define TSC_G5_IO2_FUNC          334
#define TSC_G5_IO3_FUNC          335
#define TSC_G5_IO4_FUNC          336
#define TSC_G6_IO1_FUNC          337
#define TSC_G6_IO2_FUNC          338
#define TSC_G6_IO3_FUNC          339
#define TSC_G6_IO4_FUNC          340
#define TSC_G7_IO1_FUNC          341
#define TSC_G7_IO2_FUNC          342
#define TSC_G7_IO3_FUNC          343
#define TSC_G7_IO4_FUNC          344
#define TSC_G8_IO1_FUNC          345
#define TSC_G8_IO2_FUNC          346
#define TSC_G8_IO3_FUNC          347
#define TSC_G8_IO4_FUNC          348
#define TSC_SYNC_FUNC            349
#define UART4_CTS_FUNC           350
#define UART4_DE_FUNC            351
#define UART4_RTS_FUNC           352
#define UART4_RX_FUNC            353
#define UART4_TX_FUNC            354
#define UART5_CTS_FUNC           355
#define UART5_DE_FUNC            356
#define UART5_RTS_FUNC           357
#define UART5_RX_FUNC            358
#define UART5_TX_FUNC            359
#define UCPD1_FRSTX1_FUNC        360
#define UCPD1_FRSTX2_FUNC        361
#define USART1_CK_FUNC           362
#define UART1_CK_FUNC            362
#define USART1_CTS_FUNC          363
#define UART1_CTS_FUNC           363
#define USART1_DE_FUNC           364
#define UART1_DE_FUNC            364
#define USART1_RTS_FUNC          365
#define UART1_RTS_FUNC           365
#define USART1_RX_FUNC           366
#define UART1_RX_FUNC            366
#define USART1_TX_FUNC           367
#define UART1_TX_FUNC            367
#define USART2_CK_FUNC           368
#define UART2_CK_FUNC            368
#define USART2_CTS_FUNC          369
#define UART2_CTS_FUNC           369
#define USART2_DE_FUNC           370
#define UART2_DE_FUNC            370
#define USART2_RTS_FUNC          371
#define UART2_RTS_FUNC           371
#define USART2_RX_FUNC           372
#define UART2_RX_FUNC            372
#define USART2_TX_FUNC           373
#define UART2_TX_FUNC            373
#define USART3_CK_FUNC           374
#define UART3_CK_FUNC            374
#define USART3_CTS_FUNC          375
#define UART3_CTS_FUNC           375
#define USART3_DE_FUNC           376
#define UART3_DE_FUNC            376
#define USART3_RTS_FUNC          377
#define UART3_RTS_FUNC           377
#define USART3_RX_FUNC           378
#define UART3_RX_FUNC            378
#define USART3_TX_FUNC           379
#define UART3_TX_FUNC            379
#define USB_OTG_FS_DM_FUNC       380
#define USB_OTG_FS_DP_FUNC       381
#define USB_OTG_FS_ID_FUNC       382
#define USB_OTG_FS_NOE_FUNC      383
#define USB_OTG_FS_SOF_FUNC      384

