UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32u5x_pinmux.h
	((gpio == PC01) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PC01) && (func == OCTOSPIM_P1_IO4_FUNC     )) ? 10 : \
	((gpio == PC01) && (func == SDMMC2_CK_FUNC           )) ? 12 : \
	((gpio == PC01) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC02) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == MDF1_CCK1_FUNC           )) ?  6 : \
	((gpio == PC02) && (func == TSC_G3_IO1_FUNC          )) ?  9 : \
	((gpio == PC02) && (func == OCTOSPIM_P1_IO5_FUNC     )) ? 10 : \
	((gpio == PC02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC03) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PC03) && (func == LPTIM3_CH1_FUNC          )) ?  2 : \
	((gpio == PC03) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == TSC_G1_IO4_FUNC          )) ?  9 : \
	((gpio == PC03) && (func == OCTOSPIM_P1_IO6_FUNC     )) ? 10 : \
	((gpio == PC03) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PC03) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC04) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC04) && (func == OCTOSPIM_P1_IO7_FUNC     )) ? 10 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC05) && (func == TIM1_CH4N_FUNC           )) ?  1 : \
	((gpio == PC05) && (func == SAI1_D3_FUNC             )) ?  3 : \
	((gpio == PC05) && (func == PSSI_D15_FUNC            )) ?  4 : \
	((gpio == PC05) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC06) && (func == PWR_CSLEEP_FUNC          )) ?  0 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PC06) && (func == MDF1_CKI3_FUNC           )) ?  6 : \
	((gpio == PC06) && (func == SDMMC1_D0DIR_FUNC        )) ?  8 : \
	((gpio == PC06) && (func == TSC_G4_IO1_FUNC          )) ?  9 : \
	((gpio == PC06) && (func == DCMI_D0_FUNC             )) ? 10 : \
	((gpio == PC06) && (func == PSSI_D0_FUNC             )) ? 10 : \
	((gpio == PC06) && (func == SDMMC2_D6_FUNC           )) ? 11 : \
	((gpio == PC06) && (func == SDMMC1_D6_FUNC           )) ? 12 : \
	((gpio == PC06) && (func == SAI2_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PC06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC07) && (func == PWR_CDSTOP_FUNC          )) ?  0 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PC07) && (func == MDF1_SDI3_FUNC           )) ?  6 : \
	((gpio == PC07) && (func == SDMMC1_D123DIR_FUNC      )) ?  8 : \
	((gpio == PC07) && (func == TSC_G4_IO2_FUNC          )) ?  9 : \
	((gpio == PC07) && (func == DCMI_D1_FUNC             )) ? 10 : \
	((gpio == PC07) && (func == PSSI_D1_FUNC             )) ? 10 : \
	((gpio == PC07) && (func == SDMMC2_D7_FUNC           )) ? 11 : \
	((gpio == PC07) && (func == SDMMC1_D7_FUNC           )) ? 12 : \
	((gpio == PC07) && (func == SAI2_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PC07) && (func == LPTIM2_CH2_FUNC          )) ? 14 : \
	((gpio == PC07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC08) && (func == PWR_SRDSTOP_FUNC         )) ?  0 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PC08) && (func == TSC_G4_IO3_FUNC          )) ?  9 : \
	((gpio == PC08) && (func == DCMI_D2_FUNC             )) ? 10 : \
	((gpio == PC08) && (func == PSSI_D2_FUNC             )) ? 10 : \
	((gpio == PC08) && (func == SDMMC1_D0_FUNC           )) ? 12 : \
	((gpio == PC08) && (func == LPTIM3_CH1_FUNC          )) ? 14 : \
	((gpio == PC08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC09) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PC09) && (func == TIM8_BKIN2_FUNC          )) ?  1 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PC09) && (func == DCMI_D3_FUNC             )) ?  4 : \
	((gpio == PC09) && (func == PSSI_D3_FUNC             )) ?  4 : \
	((gpio == PC09) && (func == TSC_G4_IO4_FUNC          )) ?  9 : \
	((gpio == PC09) && (func == USB_OTG_FS_NOE_FUNC      )) ? 10 : \
	((gpio == PC09) && (func == SDMMC1_D1_FUNC           )) ? 12 : \
	((gpio == PC09) && (func == LPTIM3_CH2_FUNC          )) ? 14 : \
	((gpio == PC09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC10) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PC10) && (func == LPTIM3_ETR_FUNC          )) ?  2 : \
	((gpio == PC10) && (func == ADF1_CCK1_FUNC           )) ?  3 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PC10) && (func == TSC_G3_IO2_FUNC          )) ?  9 : \
	((gpio == PC10) && (func == DCMI_D8_FUNC             )) ? 10 : \
	((gpio == PC10) && (func == PSSI_D8_FUNC             )) ? 10 : \
	((gpio == PC10) && (func == SDMMC1_D2_FUNC           )) ? 12 : \
	((gpio == PC10) && (func == SAI2_SCK_B_FUNC          )) ? 13 : \
	((gpio == PC10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC11) && (func == LPTIM3_IN1_FUNC          )) ?  2 : \
	((gpio == PC11) && (func == ADF1_SDI0_FUNC           )) ?  3 : \
	((gpio == PC11) && (func == DCMI_D2_FUNC             )) ?  4 : \
	((gpio == PC11) && (func == PSSI_D2_FUNC             )) ?  4 : \
	((gpio == PC11) && (func == OCTOSPIM_P1_NCS_FUNC     )) ?  5 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == TSC_G3_IO3_FUNC          )) ?  9 : \
	((gpio == PC11) && (func == DCMI_D4_FUNC             )) ? 10 : \
	((gpio == PC11) && (func == PSSI_D4_FUNC             )) ? 10 : \
	((gpio == PC11) && (func == UCPD1_FRSTX2_FUNC        )) ? 11 : \
	((gpio == PC11) && (func == SDMMC1_D3_FUNC           )) ? 12 : \
	((gpio == PC11) && (func == SAI2_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PC11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC12) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == TSC_G3_IO4_FUNC          )) ?  9 : \
	((gpio == PC12) && (func == DCMI_D9_FUNC             )) ? 10 : \
	((gpio == PC12) && (func == PSSI_D9_FUNC             )) ? 10 : \
	((gpio == PC12) && (func == SDMMC1_CK_FUNC           )) ? 12 : \
	((gpio == PC12) && (func == SAI2_SD_B_FUNC           )) ? 13 : \
	((gpio == PC12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PC15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD00) && (func == TIM8_CH4N_FUNC           )) ?  3 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PD00) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PD00) && (func == FMC_D2_FUNC              )) ? 12 : \
	((gpio == PD00) && (func == FMC_DA2_FUNC             )) ? 12 : \
	((gpio == PD00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD01) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PD01) && (func == FMC_D3_FUNC              )) ? 12 : \
	((gpio == PD01) && (func == FMC_DA3_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD02) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD02) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == TSC_SYNC_FUNC            )) ?  9 : \
	((gpio == PD02) && (func == DCMI_D11_FUNC            )) ? 10 : \
	((gpio == PD02) && (func == PSSI_D11_FUNC            )) ? 10 : \
	((gpio == PD02) && (func == SDMMC1_CMD_FUNC          )) ? 12 : \
	((gpio == PD02) && (func == LPTIM4_ETR_FUNC          )) ? 13 : \
	((gpio == PD02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  3 : \
	((gpio == PD03) && (func == DCMI_D5_FUNC             )) ?  4 : \
	((gpio == PD03) && (func == PSSI_D5_FUNC             )) ?  4 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PD03) && (func == MDF1_SDI0_FUNC           )) ?  6 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == OCTOSPIM_P2_NCS_FUNC     )) ? 10 : \
	((gpio == PD03) && (func == FMC_CLK_FUNC             )) ? 12 : \
	((gpio == PD03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PD04) && (func == MDF1_CKI0_FUNC           )) ?  6 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  7 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == OCTOSPIM_P1_IO4_FUNC     )) ? 10 : \
	((gpio == PD04) && (func == FMC_NOE_FUNC             )) ? 12 : \
	((gpio == PD04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD05) && (func == SPI2_RDY_FUNC            )) ?  5 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == OCTOSPIM_P1_IO5_FUNC     )) ? 10 : \
	((gpio == PD05) && (func == FMC_NWE_FUNC             )) ? 12 : \
	((gpio == PD05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD06) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PD06) && (func == DCMI_D10_FUNC            )) ?  4 : \
	((gpio == PD06) && (func == PSSI_D10_FUNC            )) ?  4 : \
	((gpio == PD06) && (func == SPI3_MOSI_FUNC           )) ?  5 : \
	((gpio == PD06) && (func == MDF1_SDI1_FUNC           )) ?  6 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == OCTOSPIM_P1_IO6_FUNC     )) ? 10 : \
	((gpio == PD06) && (func == SDMMC2_CK_FUNC           )) ? 11 : \
	((gpio == PD06) && (func == FMC_NWAIT_FUNC           )) ? 12 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PD06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD07) && (func == MDF1_CKI1_FUNC           )) ?  6 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == OCTOSPIM_P1_IO7_FUNC     )) ? 10 : \
	((gpio == PD07) && (func == SDMMC2_CMD_FUNC          )) ? 11 : \
	((gpio == PD07) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PD07) && (func == FMC_NE1_FUNC             )) ? 12 : \
	((gpio == PD07) && (func == LPTIM4_OUT_FUNC          )) ? 13 : \
	((gpio == PD07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == DCMI_HSYNC_FUNC          )) ? 10 : \
	((gpio == PD08) && (func == PSSI_DE_FUNC             )) ? 10 : \
	((gpio == PD08) && (func == FMC_D13_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == FMC_DA13_FUNC            )) ? 12 : \
	((gpio == PD08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD09) && (func == LPTIM2_IN2_FUNC          )) ?  2 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == DCMI_PIXCLK_FUNC         )) ? 10 : \
	((gpio == PD09) && (func == PSSI_PDCK_FUNC           )) ? 10 : \
	((gpio == PD09) && (func == FMC_D14_FUNC             )) ? 12 : \
	((gpio == PD09) && (func == FMC_DA14_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == SAI2_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PD09) && (func == LPTIM3_IN1_FUNC          )) ? 14 : \
	((gpio == PD09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD10) && (func == LPTIM2_CH2_FUNC          )) ?  2 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == TSC_G6_IO1_FUNC          )) ?  9 : \
	((gpio == PD10) && (func == FMC_D15_FUNC             )) ? 12 : \
	((gpio == PD10) && (func == FMC_DA15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == SAI2_SCK_A_FUNC          )) ? 13 : \
	((gpio == PD10) && (func == LPTIM3_ETR_FUNC          )) ? 14 : \
	((gpio == PD10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD11) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == TSC_G6_IO2_FUNC          )) ?  9 : \
	((gpio == PD11) && (func == FMC_A16_FUNC             )) ? 12 : \
	((gpio == PD11) && (func == SAI2_SD_A_FUNC           )) ? 13 : \
	((gpio == PD11) && (func == LPTIM2_ETR_FUNC          )) ? 14 : \
	((gpio == PD11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PD12) && (func == USART3_DE_FUNC           )) ?  7 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == TSC_G6_IO3_FUNC          )) ?  9 : \
	((gpio == PD12) && (func == FMC_A17_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == SAI2_FS_A_FUNC           )) ? 13 : \
	((gpio == PD12) && (func == LPTIM2_IN1_FUNC          )) ? 14 : \
	((gpio == PD12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PD13) && (func == TSC_G6_IO4_FUNC          )) ?  9 : \
	((gpio == PD13) && (func == FMC_A18_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == LPTIM4_IN1_FUNC          )) ? 13 : \
	((gpio == PD13) && (func == LPTIM2_CH1_FUNC          )) ? 14 : \
	((gpio == PD13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == FMC_D0_FUNC              )) ? 12 : \
	((gpio == PD14) && (func == FMC_DA0_FUNC             )) ? 12 : \
	((gpio == PD14) && (func == LPTIM3_CH1_FUNC          )) ? 14 : \
	((gpio == PD14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == FMC_D1_FUNC              )) ? 12 : \
	((gpio == PD15) && (func == FMC_DA1_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == LPTIM3_CH2_FUNC          )) ? 14 : \
	((gpio == PD15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == DCMI_D2_FUNC             )) ? 10 : \
	((gpio == PE00) && (func == PSSI_D2_FUNC             )) ? 10 : \
	((gpio == PE00) && (func == FMC_NBL0_FUNC            )) ? 12 : \
	((gpio == PE00) && (func == TIM16_CH1_FUNC           )) ? 14 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE01) && (func == DCMI_D3_FUNC             )) ? 10 : \
	((gpio == PE01) && (func == PSSI_D3_FUNC             )) ? 10 : \
	((gpio == PE01) && (func == FMC_NBL1_FUNC            )) ? 12 : \
	((gpio == PE01) && (func == TIM17_CH1_FUNC           )) ? 14 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE02) && (func == DEBUG_TRACECLK_FUNC      )) ?  0 : \
	((gpio == PE02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PE02) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PE02) && (func == TSC_G7_IO1_FUNC          )) ?  9 : \
	((gpio == PE02) && (func == FMC_A23_FUNC             )) ? 12 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PE02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE03) && (func == DEBUG_TRACED0_FUNC       )) ?  0 : \
	((gpio == PE03) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PE03) && (func == OCTOSPIM_P1_DQS_FUNC     )) ?  3 : \
	((gpio == PE03) && (func == TSC_G7_IO2_FUNC          )) ?  9 : \
	((gpio == PE03) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE04) && (func == DEBUG_TRACED1_FUNC       )) ?  0 : \
	((gpio == PE04) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PE04) && (func == SAI1_D2_FUNC             )) ?  3 : \
	((gpio == PE04) && (func == MDF1_SDI3_FUNC           )) ?  6 : \
	((gpio == PE04) && (func == TSC_G7_IO3_FUNC          )) ?  9 : \
	((gpio == PE04) && (func == DCMI_D4_FUNC             )) ? 10 : \
	((gpio == PE04) && (func == PSSI_D4_FUNC             )) ? 10 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ? 13 : \
	((gpio == PE04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE05) && (func == DEBUG_TRACED2_FUNC       )) ?  0 : \
	((gpio == PE05) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PE05) && (func == SAI1_CK2_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == MDF1_CKI3_FUNC           )) ?  6 : \
	((gpio == PE05) && (func == TSC_G7_IO4_FUNC          )) ?  9 : \
	((gpio == PE05) && (func == DCMI_D6_FUNC             )) ? 10 : \
	((gpio == PE05) && (func == PSSI_D6_FUNC             )) ? 10 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ? 13 : \
	((gpio == PE05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE06) && (func == DEBUG_TRACED3_FUNC       )) ?  0 : \
	((gpio == PE06) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PE06) && (func == SAI1_D1_FUNC             )) ?  3 : \
	((gpio == PE06) && (func == DCMI_D7_FUNC             )) ? 10 : \
	((gpio == PE06) && (func == PSSI_D7_FUNC             )) ? 10 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ? 13 : \
	((gpio == PE06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == MDF1_SDI2_FUNC           )) ?  6 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE07) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PE07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == MDF1_CKI2_FUNC           )) ?  6 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PE08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == ADF1_CCK0_FUNC           )) ?  3 : \
	((gpio == PE09) && (func == MDF1_CCK0_FUNC           )) ?  6 : \
	((gpio == PE09) && (func == OCTOSPIM_P1_NCLK_FUNC    )) ? 10 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PE09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == ADF1_SDI0_FUNC           )) ?  3 : \
	((gpio == PE10) && (func == MDF1_SDI4_FUNC           )) ?  6 : \
	((gpio == PE10) && (func == TSC_G5_IO1_FUNC          )) ?  9 : \
	((gpio == PE10) && (func == OCTOSPIM_P1_CLK_FUNC     )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PE10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == SPI1_RDY_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == MDF1_CKI4_FUNC           )) ?  6 : \
	((gpio == PE11) && (func == TSC_G5_IO2_FUNC          )) ?  9 : \
	((gpio == PE11) && (func == OCTOSPIM_P1_NCS_FUNC     )) ? 10 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == MDF1_SDI5_FUNC           )) ?  6 : \
	((gpio == PE12) && (func == TSC_G5_IO3_FUNC          )) ?  9 : \
	((gpio == PE12) && (func == OCTOSPIM_P1_IO0_FUNC     )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PE13) && (func == MDF1_CKI5_FUNC           )) ?  6 : \
	((gpio == PE13) && (func == TSC_G5_IO4_FUNC          )) ?  9 : \
	((gpio == PE13) && (func == OCTOSPIM_P1_IO1_FUNC     )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == TIM1_BKIN2_FUNC          )) ?  2 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == OCTOSPIM_P1_IO2_FUNC     )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == TIM1_CH4N_FUNC           )) ?  3 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PE15) && (func == OCTOSPIM_P1_IO3_FUNC     )) ? 10 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == OCTOSPIM_P2_IO0_FUNC     )) ?  5 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == OCTOSPIM_P2_IO1_FUNC     )) ?  5 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF02) && (func == LPTIM3_CH2_FUNC          )) ?  2 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == OCTOSPIM_P2_IO2_FUNC     )) ?  5 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
