UweBonnes/ethernut/nut/include/arch/cm3/stm/generated/stm32u5x_pinmux.h
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF03) && (func == LPTIM3_IN1_FUNC          )) ?  2 : \
	((gpio == PF03) && (func == OCTOSPIM_P2_IO3_FUNC     )) ?  5 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF04) && (func == LPTIM3_ETR_FUNC          )) ?  2 : \
	((gpio == PF04) && (func == OCTOSPIM_P2_CLK_FUNC     )) ?  5 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF05) && (func == LPTIM3_CH1_FUNC          )) ?  2 : \
	((gpio == PF05) && (func == OCTOSPIM_P2_NCLK_FUNC    )) ?  5 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF06) && (func == TIM5_ETR_FUNC            )) ?  1 : \
	((gpio == PF06) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == DCMI_D12_FUNC            )) ?  4 : \
	((gpio == PF06) && (func == PSSI_D12_FUNC            )) ?  4 : \
	((gpio == PF06) && (func == OCTOSPIM_P2_NCS_FUNC     )) ?  5 : \
	((gpio == PF06) && (func == OCTOSPIM_P1_IO3_FUNC     )) ? 10 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ? 13 : \
	((gpio == PF06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF07) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PF07) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PF07) && (func == OCTOSPIM_P1_IO2_FUNC     )) ? 10 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PF07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF08) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PF08) && (func == PSSI_D14_FUNC            )) ?  4 : \
	((gpio == PF08) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == OCTOSPIM_P1_IO0_FUNC     )) ? 10 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ? 13 : \
	((gpio == PF08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF09) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PF09) && (func == PSSI_D15_FUNC            )) ?  4 : \
	((gpio == PF09) && (func == OCTOSPIM_P1_IO1_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ? 13 : \
	((gpio == PF09) && (func == TIM15_CH1_FUNC           )) ? 14 : \
	((gpio == PF09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF10) && (func == OCTOSPIM_P1_CLK_FUNC     )) ?  3 : \
	((gpio == PF10) && (func == PSSI_D15_FUNC            )) ?  4 : \
	((gpio == PF10) && (func == MDF1_CCK1_FUNC           )) ?  6 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 10 : \
	((gpio == PF10) && (func == PSSI_D11_FUNC            )) ? 10 : \
	((gpio == PF10) && (func == SAI1_D3_FUNC             )) ? 13 : \
	((gpio == PF10) && (func == TIM15_CH2_FUNC           )) ? 14 : \
	((gpio == PF10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF11) && (func == OCTOSPIM_P1_NCLK_FUNC    )) ?  3 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 10 : \
	((gpio == PF11) && (func == PSSI_D12_FUNC            )) ? 10 : \
	((gpio == PF11) && (func == LPTIM4_IN1_FUNC          )) ? 13 : \
	((gpio == PF11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF12) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  5 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF12) && (func == LPTIM4_ETR_FUNC          )) ? 13 : \
	((gpio == PF12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF13) && (func == I2C4_SMBA_FUNC           )) ?  4 : \
	((gpio == PF13) && (func == UCPD1_FRSTX2_FUNC        )) ? 11 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == LPTIM4_OUT_FUNC          )) ? 13 : \
	((gpio == PF13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF14) && (func == I2C4_SCL_FUNC            )) ?  4 : \
	((gpio == PF14) && (func == TSC_G8_IO1_FUNC          )) ?  9 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PF15) && (func == I2C4_SDA_FUNC            )) ?  4 : \
	((gpio == PF15) && (func == TSC_G8_IO2_FUNC          )) ?  9 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG00) && (func == OCTOSPIM_P2_IO4_FUNC     )) ?  5 : \
	((gpio == PG00) && (func == TSC_G8_IO3_FUNC          )) ?  9 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG01) && (func == OCTOSPIM_P2_IO5_FUNC     )) ?  5 : \
	((gpio == PG01) && (func == TSC_G8_IO4_FUNC          )) ?  9 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG02) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == SAI2_SCK_B_FUNC          )) ? 13 : \
	((gpio == PG02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG03) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == SAI2_FS_B_FUNC           )) ? 13 : \
	((gpio == PG03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG04) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == SAI2_MCLK_B_FUNC         )) ? 13 : \
	((gpio == PG04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG05) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PG05) && (func == LPUART1_CTS_FUNC         )) ?  8 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == SAI2_SD_B_FUNC           )) ? 13 : \
	((gpio == PG05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG06) && (func == OCTOSPIM_P1_DQS_FUNC     )) ?  3 : \
	((gpio == PG06) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PG06) && (func == SPI1_RDY_FUNC            )) ?  5 : \
	((gpio == PG06) && (func == LPUART1_DE_FUNC          )) ?  8 : \
	((gpio == PG06) && (func == LPUART1_RTS_FUNC         )) ?  8 : \
	((gpio == PG06) && (func == UCPD1_FRSTX1_FUNC        )) ? 11 : \
	((gpio == PG06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG07) && (func == SAI1_CK1_FUNC            )) ?  3 : \
	((gpio == PG07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PG07) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  5 : \
	((gpio == PG07) && (func == MDF1_CCK0_FUNC           )) ?  6 : \
	((gpio == PG07) && (func == LPUART1_TX_FUNC          )) ?  8 : \
	((gpio == PG07) && (func == UCPD1_FRSTX2_FUNC        )) ? 11 : \
	((gpio == PG07) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG07) && (func == SAI1_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PG07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PG08) && (func == LPUART1_RX_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG09) && (func == OCTOSPIM_P2_IO6_FUNC     )) ?  5 : \
	((gpio == PG09) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PG09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == SAI2_SCK_A_FUNC          )) ? 13 : \
	((gpio == PG09) && (func == TIM15_CH1N_FUNC          )) ? 14 : \
	((gpio == PG09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG10) && (func == LPTIM1_IN1_FUNC          )) ?  1 : \
	((gpio == PG10) && (func == OCTOSPIM_P2_IO7_FUNC     )) ?  5 : \
	((gpio == PG10) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PG10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == SAI2_FS_A_FUNC           )) ? 13 : \
	((gpio == PG10) && (func == TIM15_CH1_FUNC           )) ? 14 : \
	((gpio == PG10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG11) && (func == LPTIM1_IN2_FUNC          )) ?  1 : \
	((gpio == PG11) && (func == OCTOSPIM_P1_IO5_FUNC     )) ?  3 : \
	((gpio == PG11) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PG11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PG11) && (func == SAI2_MCLK_A_FUNC         )) ? 13 : \
	((gpio == PG11) && (func == TIM15_CH2_FUNC           )) ? 14 : \
	((gpio == PG11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG12) && (func == LPTIM1_ETR_FUNC          )) ?  1 : \
	((gpio == PG12) && (func == OCTOSPIM_P2_NCS_FUNC     )) ?  5 : \
	((gpio == PG12) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PG12) && (func == USART1_DE_FUNC           )) ?  7 : \
	((gpio == PG12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == SAI2_SD_A_FUNC           )) ? 13 : \
	((gpio == PG12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG13) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PG13) && (func == SPI3_RDY_FUNC            )) ?  6 : \
	((gpio == PG13) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG14) && (func == LPTIM1_CH2_FUNC          )) ?  1 : \
	((gpio == PG14) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PG15) && (func == LPTIM1_CH1_FUNC          )) ?  1 : \
	((gpio == PG15) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PG15) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  5 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 10 : \
	((gpio == PG15) && (func == PSSI_D13_FUNC            )) ? 10 : \
	((gpio == PG15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH02) && (func == OCTOSPIM_P1_IO4_FUNC     )) ?  3 : \
	((gpio == PH02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == OCTOSPIM_P2_DQS_FUNC     )) ?  5 : \
	((gpio == PH04) && (func == PSSI_D14_FUNC            )) ? 10 : \
	((gpio == PH04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == DCMI_PIXCLK_FUNC         )) ? 10 : \
	((gpio == PH05) && (func == PSSI_PDCK_FUNC           )) ? 10 : \
	((gpio == PH05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == OCTOSPIM_P2_CLK_FUNC     )) ?  5 : \
	((gpio == PH06) && (func == DCMI_D8_FUNC             )) ? 10 : \
	((gpio == PH06) && (func == PSSI_D8_FUNC             )) ? 10 : \
	((gpio == PH06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == OCTOSPIM_P2_NCLK_FUNC    )) ?  5 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 10 : \
	((gpio == PH07) && (func == PSSI_D9_FUNC             )) ? 10 : \
	((gpio == PH07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == OCTOSPIM_P2_IO3_FUNC     )) ?  5 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 10 : \
	((gpio == PH08) && (func == PSSI_DE_FUNC             )) ? 10 : \
	((gpio == PH08) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == OCTOSPIM_P2_IO4_FUNC     )) ?  5 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 10 : \
	((gpio == PH09) && (func == PSSI_D0_FUNC             )) ? 10 : \
	((gpio == PH09) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == OCTOSPIM_P2_IO5_FUNC     )) ?  5 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 10 : \
	((gpio == PH10) && (func == PSSI_D1_FUNC             )) ? 10 : \
	((gpio == PH10) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == OCTOSPIM_P2_IO6_FUNC     )) ?  5 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 10 : \
	((gpio == PH11) && (func == PSSI_D2_FUNC             )) ? 10 : \
	((gpio == PH11) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == TIM8_CH4N_FUNC           )) ?  3 : \
	((gpio == PH12) && (func == OCTOSPIM_P2_IO7_FUNC     )) ?  5 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 10 : \
	((gpio == PH12) && (func == PSSI_D3_FUNC             )) ? 10 : \
	((gpio == PH12) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == FDCAN1_TX_FUNC           )) ?  9 : \
	((gpio == PH13) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == FDCAN1_RX_FUNC           )) ?  9 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 10 : \
	((gpio == PH14) && (func == PSSI_D4_FUNC             )) ? 10 : \
	((gpio == PH14) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == OCTOSPIM_P2_IO6_FUNC     )) ?  5 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 10 : \
	((gpio == PH15) && (func == PSSI_D11_FUNC            )) ? 10 : \
	((gpio == PH15) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == OCTOSPIM_P1_IO5_FUNC     )) ?  3 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 10 : \
	((gpio == PI00) && (func == PSSI_D13_FUNC            )) ? 10 : \
	((gpio == PI00) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == OCTOSPIM_P2_IO2_FUNC     )) ?  6 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 10 : \
	((gpio == PI01) && (func == PSSI_D8_FUNC             )) ? 10 : \
	((gpio == PI01) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == OCTOSPIM_P2_IO1_FUNC     )) ?  6 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 10 : \
	((gpio == PI02) && (func == PSSI_D9_FUNC             )) ? 10 : \
	((gpio == PI02) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == OCTOSPIM_P2_IO0_FUNC     )) ?  6 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 10 : \
	((gpio == PI03) && (func == PSSI_D10_FUNC            )) ? 10 : \
	((gpio == PI03) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SPI2_RDY_FUNC            )) ?  5 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 10 : \
	((gpio == PI04) && (func == PSSI_D5_FUNC             )) ? 10 : \
	((gpio == PI04) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == OCTOSPIM_P2_NCS_FUNC     )) ?  5 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == PSSI_RDY_FUNC            )) ? 10 : \
	((gpio == PI05) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == OCTOSPIM_P2_CLK_FUNC     )) ?  5 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 10 : \
	((gpio == PI06) && (func == PSSI_D6_FUNC             )) ? 10 : \
	((gpio == PI06) && (func == EVENTOUT_FUNC            )) ? 15 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == OCTOSPIM_P2_NCLK_FUNC    )) ?  5 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 10 : \
	((gpio == PI07) && (func == PSSI_D7_FUNC             )) ? 10 : \
	((gpio == PI07) && (func == EVENTOUT_FUNC            )) ? 15 : \
	AF_NO_SUCH_PINFUNC)

